[{"tags": ["applet"], "alternative": "Use embed or object instead."}, {"tags": ["acronym"], "alternative": "Use abbr instead."}, {"tags": ["bgsound"], "alternative": "Use audio instead."}, {"tags": ["dir"], "alternative": "Use ul instead."}, {"tags": ["frame", "frameset", "noframes"], "alternative": "Either use iframe and CSS instead, or use server-side includes to generate  complete pages with the various invariant parts merged in."}, {"tags": ["isindex"], "alternative": "Use an explicit form and text control combination instead."}, {"tags": ["listing"], "alternative": "Use pre and code instead."}, {"tags": ["nextid"], "alternative": "Use GUIDs instead."}, {"tags": ["noembed"], "alternative": "Use object instead of embed when fallback is necessary."}, {"tags": ["plaintext"], "alternative": "Use the \"text/plain\" MIME type instead."}, {"tags": ["rb", "rtc"], "alternative": "Providing the ruby base directly inside the ruby element or using nested ruby elements  is sufficient."}, {"tags": ["strike"], "alternative": "Use del instead if the element is marking an edit, otherwise use s instead."}, {"tags": ["xmp"], "alternative": "Use pre and code instead, and escape \"<\" and  \"&\" characters as \"&lt;\" and \"&amp;\"  respectively."}, {"tags": ["basefont", "big", "blink", "center", "font", "marquee", "menu", "menuitem", "multicol", "nobr", "spacer", "tt"], "alternative": "Use appropriate elements or CSS instead.Where the tt element would have been used for marking up keyboard input,  consider the kbd element; for variables, consider the var element;  for computer code, consider the code element; and for computer output, consider  the samp element.Similarly, if the big element is being used to denote a heading, consider using  the h1 element; if it is being used for marking up important passages, consider  the strong element; and if it is being used for highlighting text for reference  purposes, consider the mark element.See also the text-level semantics usage summary for more suggestions with examples."}]